{
    "en": {
            "WELCOME_MSG": "Hello! Welcome to LSF Room Service. What can I do for you?",
            "WELCOME_REPROMPT_MSG": "You can say for example, find a free room in building twenty two.",
            "WELCOME_BACK_MSG": "Welcome back. You have a reservation for the room {} from {} till {}. What else can I do for you?",
            "HELP_MSG": "You can tell me find a free room in building 22 or find a free room now in building 22, and I will ask further questions about the room and find suitable rooms for you at the end.",
            "GOODBYE_MSG": "Goodbye!",
            "REFLECTOR_MSG": "You just triggered {}",
            "ERROR_MSG": "Sorry, I couldn't understand what you said. Can you reformulate?",
            "ERROR_TIMEZONE_MSG": "I can't determine your timezone. Please check your device settings and make sure a timezone was selected. After that please reopen the skill and try again!",
            "RESULT_MSG" : "I have found {} room for you. It is: ",
            "RESULTS_MSG" : "I have found {} rooms for you. They are: ",
            "NO_RESULT_MSG" : "Sorry! I couldn't find any rooms.",
            "BUT_NO_RESULT_MSG" : "But sorry! I couldn't find any rooms.",
            "RESERVE_MSG" : "Do you want to reserve any rooms?  (Please say Yes or No).",
            "YES_RESERVED_MSG": "Ok. I have reserved the room {} for the specified amount of time.",
            "NO_RESERVED_MSG": "Sorry. I could not reserve a room for you.",
            "TEST_MSG": "Here are the results. You can reserve a room if needed.",
            "RESERVE_PROMPT_MSG": "To reserve a room you can say for example, reserve a room in building twenty nine for two hours.",
            "TRY_AGAIN": "Do you want to try again? (Please say Yes or No).",
            "INVALID_OPTION": "Invalid option entry. There are only {} records. You need to enter a value less than or equal to the number of records.",
            "USER_CANNOT_BOOK": "But you cannot reserve a room. A reservation already exist in your name which expires only by {}.",
            "NO_RESERVATION": "Sorry, you donot have any reservations.",
            "CANCEL_RESERVATION": "Your reservation has been cancelled.",
            "ERROR_RESERVATION_CANCEL": "There was an error while cancelling your reservation.",
            "CONFIRM_CANCELLATION": "Do you want to confirm? (Please say Yes or No).",
            "TOTAL_ALTERNATE_MSG": "However, I have {} alternative for you. Do you want to see them? (Please say Yes or No).",
            "TOTAL_ALTERNATES_MSG": "However, I have {} alternatives for you. Do you want to see them? (Please say Yes or No).",
            "NO_ALTERNATE_MSG": "Unfortunately, I have no alternatives for you as well.",
            "NO_MORE_ALTERNATE_MSG": "Unfortunately, I have no more alternatives for you.",
            "ALTERNATE_EQUIP_MSG": "Ok. I have {} alternate room options in the same building for same time. But, {}.",
            "ALTERNATE_EQUIP_MSG_SINGLE": "Ok. I have {} alternate room option in the same building for same time. But, {}.",
            "NO_ALTERNATE_EQUIP_MSG": "Unfortunately, there are no alternate room options in the same building for same time.",
            "ALTERNATE_BUILD_MSG": "Ok. I have {} rooms available for same timings in different building. ",
            "ALTERNATE_BUILD_MSG_SINGLE": "Ok. I have {} room available for same timings in different building. ",
            "NO_ALTERNATE_BUILD_MSG": "Unfortunately, there are no alternate room options in different building for same timings.",
            "ALTERNATE_TIME_MSG": "Alright. I have {} rooms available in the same building for different timings, available for {} hours.",
            "ALTERNATE_TIME_MSG_SINGLE": "Alright. I have {} room available in the same building for different timings, available for {} hours.",
            "ALTERNATE_TIME_MSG_DUR": "Alright. I have {} rooms available in the same building for different timings, available for {} hour.",
            "ALTERNATE_TIME_MSG_DUR_SINGLE": "Alright. I have {} room available in the same building for different timings, available for {} hour.",
            "NO_ALTERNATE_TIME_MSG": "Unfortunately, there are no alternate room options in same building for nearby timings.",
            "ALTERNATE_SEARCH_MSG": "So then, do you want to have a fresh search right away? (Please say Yes or No).",
            "CONTINUE_MSG": "Would you like to continue to look for other search options? (Please say Yes or No).",
            "ALT_RESULT_MSG" : "It is: ",
            "ALT_RESULTS_MSG" : "They are: ",
            "NEW_SEARCH": "Please consider doing a fresh search. Bye!",
            "TIMEOUT_MSG": "Sorry! The skill took too much time to respond.",
            "TIME_ISSUE": "You cannot book a room at this time. Please try booking the room between eight a.m and eight p.m.",
            "TIME_EXPIRED": "The entered time has expired. You need to try again from the beginning. Please say Yes or No if you want to start a new search."
    }
}
